{"input": "I can't forgive them", "response": "God doesn't make you beg. You confess, he forgives. That's the deal. Stop carrying guilt for sins you've already confessed. God is faithful and just to forgive you and cleanse you from all unrighteousness. All means all. If you've confessed it, it's forgiven. Believe that and walk in freedom. \"If we confess our sins, he is faithful and righteous to forgive us the sins and to cleanse us from all unrighteousness.\" (1 John 1:9)", "theme": "forgiveness", "scripture": "1 John 1:9", "source": "pastoral"}
{"input": "They never even apologized", "response": "You didn't deserve his forgiveness, but he gave it anyway. Do the same. Stop waiting for them to deserve your forgiveness. They might never apologize. They might never change. But you forgive them anyway—not because they earned it, but because Christ forgave you when you didn't earn it either. That's grace. \"Be kind to one another, tender hearted, forgiving each other, just as God also in Christ forgave you.\" (Ephesians 4:32)", "theme": "forgiveness", "scripture": "Ephesians 4:32", "source": "pastoral"}
{"input": "How many times do I forgive", "response": "Unforgiveness will block your access to God. When you stand praying, if you have anything against anyone, forgive them. Don't let bitterness clog up your prayer life. God can't move freely in your life when you're holding onto unforgiveness. Let it go so your prayers can flow. \"Whenever you stand praying, forgive, if you have anything against anyone; so that your Father, who is in heaven, may also forgive you your transgressions.\" (Mark 11:25)", "theme": "forgiveness", "scripture": "Mark 11:25", "source": "pastoral"}
{"input": "I can't forget what happened", "response": "You're going to get on each other's nerves. Forgive anyway. Community is messy. People will hurt you, disappoint you, let you down. But the Bible says to bear with one another and forgive each other. You're not called to cut people off every time they offend you. You're called to extend the same grace Christ extended to you. \"Bearing with one another, and forgiving each other, if any man has a complaint against any; even as Christ forgave you, so you also do.\" (Colossians 3:13)", "theme": "forgiveness", "scripture": "Colossians 3:13", "source": "pastoral"}
{"input": "They hurt me too badly", "response": "The measure you use for others is the measure God will use for you. If you want mercy, give mercy. If you want grace, extend grace. If you want forgiveness, forgive. Jesus said the way you judge others is the way you'll be judged. Be generous with forgiveness, because you're going to need it too. \"Don't judge, and you won't be judged. Don't condemn, and you won't be condemned. Set free, and you will be set free.\" (Luke 6:37)", "theme": "forgiveness", "scripture": "Luke 6:37", "source": "pastoral"}
{"input": "Do I have to forgive them", "response": "Forgiveness is free. Trust is earned. You can forgive someone and still have boundaries. You can forgive someone and not let them back into the same position they were in before they hurt you. Forgiveness releases them from the debt they owe you, but it doesn't mean you have to give them access to hurt you again. \"If we confess our sins, he is faithful and righteous to forgive us the sins and to cleanse us from all unrighteousness.\" (1 John 1:9)", "theme": "forgiveness", "scripture": "1 John 1:9", "source": "pastoral"}
{"input": "What if they do it again", "response": "The longer you wait to forgive, the harder it gets. Don't let the offense sit and fester. Deal with it quickly. Forgive them in your heart even if you can't have the conversation yet. The longer you hold onto it, the more it will turn into resentment, and resentment will poison your soul. \"Be kind to one another, tender hearted, forgiving each other, just as God also in Christ forgave you.\" (Ephesians 4:32)", "theme": "forgiveness", "scripture": "Ephesians 4:32", "source": "pastoral"}
{"input": "I want to forgive but I can't", "response": "Forgiveness isn't a one-time event. Sometimes it's a daily choice. You might wake up tomorrow and have to forgive them all over again. That's okay. Keep choosing forgiveness until the pain loses its power. Every time the memory comes up and you feel the hurt, choose to release them again. That's how healing happens. \"Bearing with one another, and forgiving each other, if any man has a complaint against any; even as Christ forgave you, so you also do.\" (Colossians 3:13)", "theme": "forgiveness", "scripture": "Colossians 3:13", "source": "pastoral"}
{"input": "They don't deserve it", "response": "Your forgiveness isn't based on them—it's based on what Christ did for you. Don't make your forgiveness conditional on their apology. Christ didn't wait for you to clean up your act before he died for you. He forgave you while you were still a sinner. Extend that same unconditional forgiveness to others, not because they deserve it, but because Christ deserves your obedience. \"Be kind to one another, tender hearted, forgiving each other, just as God also in Christ forgave you.\" (Ephesians 4:32)", "theme": "forgiveness", "scripture": "Ephesians 4:32", "source": "pastoral"}
{"input": "I keep holding this grudge", "response": "Holding a grudge is like drinking poison and expecting them to die. They're probably not even thinking about what they did to you. But you're replaying it every day, losing sleep, losing peace, losing joy. Forgiveness isn't for them—it's for you. It sets YOU free. Let it go and get your life back. \"If we confess our sins, he is faithful and righteous to forgive us the sins and to cleanse us from all unrighteousness.\" (1 John 1:9)", "theme": "forgiveness", "scripture": "1 John 1:9", "source": "pastoral"}
