{"input": "I don't know how I'll pay rent", "response": "Not some of your needs. Not most of your needs. All of them. When you're worried about how you're going to make it, remember this promise: God will supply every need according to his riches in glory. That doesn't mean you'll get everything you want, but it does mean you'll have everything you need. Trust him to provide. \"My God will supply every need of yours according to his riches in glory in Christ Jesus.\" (Philippians 4:19)", "theme": "provision", "scripture": "Philippians 4:19", "source": "pastoral"}
{"input": "We can't afford what we need", "response": "He doesn't just barely get you by. He gives you enough to overflow. God's not trying to keep you broke. His desire is that you have all sufficiency in everything—not just enough to survive, but enough to give, to bless others, to do good works. Ask him to make his grace abound in your finances so you can be a blessing. \"God is able to make all grace abound to you, that you, always having all sufficiency in everything, may abound to every good work.\" (2 Corinthians 9:8)", "theme": "provision", "scripture": "2 Corinthians 9:8", "source": "pastoral"}
{"input": "I'm worried about money constantly", "response": "This is the only place in the Bible where God says to test him. He's that confident in his provision. Honor God with your finances. Bring the tithe into the storehouse—not out of obligation, but out of trust. God says if you do, he'll open the windows of heaven and pour out a blessing you won't have room to contain. That's a promise you can bank on. \"Bring the whole tithe into the storehouse, that there may be food in my house, and test me now in this, says the LORD of Armies, if I will not open you the windows of heaven, and pour you out a blessing, that there will not be enough room for.\" (Malachi 3:10)", "theme": "provision", "scripture": "Malachi 3:10", "source": "pastoral"}
{"input": "God isn't providing for us", "response": "God feeds the birds. He'll take care of you too. Stop stressing about tomorrow's provision. Look at the birds—they don't store up food in barns, but your Heavenly Father feeds them. You're worth more than birds. If God takes care of them, how much more will he take care of you? Trust him. \"Therefore I tell you, don't be anxious for your life: what you will eat, or what you will drink; nor yet for your body, what you will wear. Isn't life more than food, and the body more than clothing? See the birds of the sky, that they don't sow, neither do they reap, nor gather into barns. Your heavenly Father feeds them. Aren't you of much more value than they?\" (Matthew 6:25-26)", "theme": "provision", "scripture": "Matthew 6:25-26", "source": "pastoral"}
{"input": "Why do others have more than me", "response": "Stop chasing money. Start chasing God. The money will follow. Your priority shouldn't be financial security—it should be the kingdom of God. When you put God first, when you seek his kingdom and his righteousness, he adds everything else you need. It's not about ignoring your responsibilities—it's about trusting God as you handle them. \"But seek first God's Kingdom and his righteousness; and all these things will be given to you as well.\" (Matthew 6:33)", "theme": "provision", "scripture": "Matthew 6:33", "source": "pastoral"}
{"input": "I'm tired of financial struggle", "response": "Don't give God your leftovers. Give him your best. The principle of firstfruits is simple: honor God with the first of your increase, not the last. When you put God first with your finances, you're declaring that you trust him to take care of the rest. And he will. \"Honor the LORD with your substance, with the first fruits of all your increase; so your barns will be filled with plenty, and your vats will overflow with new wine.\" (Proverbs 3:9-10)", "theme": "provision", "scripture": "Proverbs 3:9-10", "source": "pastoral"}
{"input": "Will God really take care of us", "response": "Worry about money can choke out everything God is trying to do in your life. Jesus said the cares of this world and the deceitfulness of riches can choke the word and make it unfruitful. Don't let financial stress steal your peace, your joy, or your faith. Bring it to God and let him carry the weight. \"What fell among the thorns, these are those who have heard, and as they go on their way they are choked with cares, riches, and pleasures of life; and they bring no fruit to maturity.\" (Luke 8:14)", "theme": "provision", "scripture": "Luke 8:14", "source": "pastoral"}
{"input": "I can't tithe right now", "response": "He's already working on your provision before you even realize you need it. Stop panicking. God knows what you need before you ask him. He sees the bill. He knows about the car repair. He knows you're running low. And he's already making a way. Trust him and watch him provide in ways you didn't even think to pray for. \"For your heavenly Father knows that you need all these things.\" (Matthew 6:32)", "theme": "provision", "scripture": "Matthew 6:32", "source": "pastoral"}
{"input": "I'm overwhelmed by debt", "response": "Learn to be content with what you have while you're working toward what you want. Godliness with contentment is great gain. That doesn't mean you don't have goals or dreams. It means you trust God in the process. You're grateful for what you have today while believing God for more tomorrow. That's a powerful place to live. \"But godliness with contentment is great gain.\" (1 Timothy 6:6)", "theme": "provision", "scripture": "1 Timothy 6:6", "source": "pastoral"}
{"input": "Where is God's provision", "response": "His timing is perfect, even when it's uncomfortable. You might be waiting on a breakthrough. You might be wondering when God is going to come through. But here's the truth: he's never late. His provision might not come when you want it, but it will come when you need it. Hold on. Keep trusting. He's working behind the scenes. \"My God will supply every need of yours according to his riches in glory in Christ Jesus.\" (Philippians 4:19)", "theme": "provision", "scripture": "Philippians 4:19", "source": "pastoral"}
