{"input": "I keep falling into the same sin", "response": "Advice: Do not tolerate or hide sin in your life. Identify it, confess it, and remove it completely. Don’t make excuses or allow sin to remain comfortable in your heart.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I can't stop this habit", "response": "Scripture Reference: “If your right eye causes you to sin, tear it out and throw it away.” — Matthew 5:29-30 2. Throw Yourself on the Altar of God “Run from sin, throw yourself on the altar of God, and say, ‘Lord, have mercy on me.’”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I feel trapped by sin", "response": "Advice: Seek God’s mercy with humility and brokenness. Approach Him sincerely, repenting from the heart and depending on His grace for transformation.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "How do I overcome this", "response": "Scripture Reference: “God opposes the proud but gives grace to the humble.” — James 4:6 3. Remember You’ve Been Empowered to Live Holy “You can do this. He gave you the power not to live a life of unrepentant sin.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I hate what I'm doing but I can't stop", "response": "Advice: Believe that the Holy Spirit gives you the strength to overcome sin and live a holy life. The same power that raised Christ from the dead is at work in you.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I'm living a double life", "response": "Scripture Reference: “You will receive power when the Holy Spirit has come upon you.” — Acts 1:8 “Sin shall not have dominion over you.” — Romans 6:14 4. Live as a Separated and Holy People “You are a holy people, a royal priesthood, a peculiar people separated from the world.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "This addiction has me", "response": "Advice: Live differently from the world — consecrated, pure, and devoted to God. Your life should reflect His holiness, not the culture’s corruption.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I'm tired of failing God", "response": "Scripture Reference: “But you are a chosen people, a royal priesthood, a holy nation.” — 1 Peter 2:9 5. Stop Making Excuses “He wouldn’t tell you to cut it off or pluck it out if He didn’t empower you to do it. It’s only our excuses.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "Can I really change", "response": "Advice: Stop justifying sinful behavior. God would not command you to do what you cannot do through His Spirit. Replace excuses with obedience and faith.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I feel powerless against sin", "response": "Scripture Reference: “I can do all things through Christ who strengthens me.” — Philippians 4:13 6. Pray for Deliverance and Holiness “Lord, deliver us from our excuses… pour out on the church a spirit of reverence, honor, and holy fear.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I keep falling into the same sin", "response": "Advice: Ask God to restore holy fear, reverence, and respect for Him in your life and the Church. Pray for a heart that trembles at His Word and desires righteousness.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I can't stop this habit", "response": "Scripture Reference: “Work out your salvation with fear and trembling.” — Philippians 2:12 7. Repent Sincerely “Bow your head, close your eyes. Repent right now. Ring out your heart of sin.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I feel trapped by sin", "response": "Advice: Take time in prayer to confess and turn away from your sins. Let repentance be heartfelt, not routine. God hears even the silent cries of your mind.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "How do I overcome this", "response": "Scripture Reference: “Rend your heart and not your garments.” — Joel 2:13 8. Grow in Love for Christ “Increase your love for the Lord Jesus through prayer, devotion, reading, and worship.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I hate what I'm doing but I can't stop", "response": "Advice: The more you love Jesus, the less you will desire sin. Deepen your relationship with Him through daily prayer, studying the Word, and worship.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I'm living a double life", "response": "Scripture Reference: “If you love Me, keep My commandments.” — John 14:15 9. Pray for Hatred of Sin “Ask God to give you a hatred in your heart for sin. The more you hate sin, the more you’ll deal with it aggressively.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "This addiction has me", "response": "Advice: Pray for spiritual discernment and a godly disgust toward sin — in yourself, in the world, and even in the church. Let your sensitivity to sin drive you to purity.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I'm tired of failing God", "response": "Scripture Reference: “You who love the Lord, hate evil.” — Psalm 97:10 10. Live with Reverence and Integrity “That our message to the world would not be compromised.”", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "Can I really change", "response": "Advice: Let your life back up your message. Holiness is not only for personal purity but for witness — so the world sees the truth of Christ in you.", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
{"input": "I feel powerless against sin", "response": "Scripture Reference: “Let your light so shine before men, that they may see your good works and glorify your Father in heaven.” — Matthew 5:16", "theme": "sin", "scripture": "General wisdom", "source": "pastoral"}
