{"input": "Scripture about feeling overwhelmed", "output": "The overwhelming forces will be overwhelmed from before him, and will be broken. Yes, also the prince of the covenant. (Daniel 11:22)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Then I came to them of the captivity at Tel Aviv who lived by the river Chebar, and to where they lived; and I sat there overwhelmed among them seven days. (Ezekiel 3:15)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "For the violence done to Lebanon will overwhelm you, and the destruction of the animals will terrify you, because of men’s blood and for the violence done to the land, to every city and to those who dwell in them. (Habakkuk 2:17)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "The translators of the World English Bible regard Mark 16:9-20 as reliable based on an overwhelming majority of textual evidence, including not only the authoritative Greek Majority Text New Testament, but also the TR and many of the manuscripts cited in the NU text. Now when he had risen early on the first day of the week, he appeared first to Mary Magdalene, from whom he had cast out seven demons. (Mark 16:9)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "From the end of the earth, I will call to you when my heart is overwhelmed. (Psalms 61:2)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Sins overwhelmed me, (Psalms 65:3)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Don’t let the flood waters overwhelm me, (Psalms 69:15)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "then the waters would have overwhelmed us, (Psalms 124:4)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "If I say, “Surely the darkness will overwhelm me. (Psalms 139:11)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "When my spirit was overwhelmed within me, (Psalms 142:3)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Therefore my spirit is overwhelmed within me. (Psalms 143:4)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Solomon had seventy thousand who bore burdens, and eighty thousand who were stone cutters in the mountains, (1 Kings 5:15)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Now my father burdened you with a heavy yoke, but I will add to your yoke. My father chastised you with whips, but I will chastise you with scorpions.’” (1 Kings 12:11)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "For you remember, brothers, our labor and travail; for working night and day, that we might not burden any of you, we preached to you the Good News of God. (1 Thessalonians 2:9)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "If any man or woman who believes has widows, let them relieve them, and don’ t let the assembly be burdened, that it might relieve those who are widows indeed. (1 Timothy 5:16)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Solomon counted out seventy thousand men to bear burdens, eighty thousand men who were stone cutters in the mountains, and three thousand six hundred to oversee them. (2 Chronicles 2:2)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "He set seventy thousand of them to bear burdens, eighty thousand who were stone cutters in the mountains, and three thousand six hundred overseers to assign the people their work. (2 Chronicles 2:18)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Now whereas my father burdened you with a heavy yoke, I will add to your yoke. My father chastised you with whips, but I will chastise you with scorpions.’” (2 Chronicles 10:11)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Now concerning his sons, the greatness of the burdens laid on him, and the rebuilding of God’s house, behold, they are written in the commentary of the book of the kings. Amaziah his son reigned in his place. (2 Chronicles 24:27)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Also they were over the bearers of burdens, and directed all who did the work in every kind of service. Of the Levites, there were scribes, officials, and gatekeepers. (2 Chronicles 34:13)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "He said to the Levites who taught all Israel, who were holy to the LORD, “ Put the holy ark in the house which Solomon the son of David king of Israel built. It will no longer be a burden on your shoulders. Now serve the LORD your God and his people Israel. (2 Chronicles 35:3)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "For indeed we who are in this tent do groan, being burdened, not that we desire to be unclothed, but that we desire to be clothed, that what is mortal may be swallowed up by life. (2 Corinthians 5:4)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "When I was present with you and was in need, I wasn’ t a burden on anyone, for the brothers, when they came from Macedonia, supplied the measure of my need. In everything I kept myself from being burdensome to you, and I will continue to do so. (2 Corinthians 11:9)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "For what is there in which you were made inferior to the rest of the assemblies, unless it is that I myself was not a burden to you? Forgive me this wrong! (2 Corinthians 12:13)", "theme": "overwhelm", "type": "scripture"}
{"input": "Scripture about feeling overwhelmed", "output": "Behold, this is the third time I am ready to come to you, and I will not be a burden to you; for I seek not your possessions, but you. For the children ought not to save up for the parents, but the parents for the children. (2 Corinthians 12:14)", "theme": "overwhelm", "type": "scripture"}
{"input": "I can't keep up with everything", "output": "Come to Christ with your burdens. He promises rest for the weary. Matthew 11:28-30 isn't a suggestion—it's an invitation. Cast your anxieties on Him today, specifically and honestly.", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "Everything is too much right now", "output": "God's strength is made perfect in your weakness. Stop trying to carry what He never asked you to bear. Surrender control and trust His sufficiency. What burden can you release to Him right now?", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "I'm drowning in responsibilities", "output": "Overwhelm is often a sign you're operating in your own strength. God calls you to rest, not endless striving. Sabbath isn't optional. Schedule it. Protect it. Trust that He will handle what you cannot.", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "I feel like I'm being crushed by the weight of it all", "output": "Peace isn't the absence of problems—it's the presence of God. Philippians 4:6-7 commands you to pray instead of worry. Name your anxieties. Give them to God. His peace will guard your heart.", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "I don't know how to handle all of this", "output": "You weren't designed to do it all. God gives you the grace you need for today—not tomorrow, not next week. Focus on what He's called you to right now. One step of obedience at a time.", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "I'm exhausted and can't catch my breath", "output": "Psalm 55:22 says cast your burden on the Lord. That's not passive—it's an active choice. What specific burden will you release today? Write it down. Pray over it. Leave it with Him.", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "There's no end in sight to all my problems", "output": "Jesus carried the cross so you don't have to carry crushing burdens. He invites you into His yoke—light and easy. What are you trying to control that you need to surrender?", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "I feel like I'm failing at everything", "output": "God is your refuge and strength, a very present help in trouble (Psalm 46:1). Run to Him. Not later—now. Pour out your heart. He already knows, but He wants you to trust Him with it.", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "The pressure is unbearable", "output": "Anxiety reveals what you're trusting in. When overwhelmed, ask: Am I trusting God's provision or my own effort? Repent of self-reliance. Trust His promises. He is faithful.", "theme": "overwhelm", "type": "pastoral_response"}
{"input": "I'm completely overwhelmed and don't know where to turn", "output": "The Lord is near to the brokenhearted. Your overwhelm doesn't disqualify you—it positions you to experience His strength. Be honest with Him. He can handle your struggles.", "theme": "overwhelm", "type": "pastoral_response"}
