{"input": "I can't let go of what they did", "response": "Anger itself isn't the sin—it's what you do with it that counts. It's okay to feel angry. Even Jesus got angry. But don't let that anger control you. Don't let it make you say things you can't take back or do things you'll regret. Feel the anger, bring it to God, and then let him show you how to handle it righteously. \"Be angry, and don't sin. Don't let the sun go down on your wrath.\" (Ephesians 4:26)", "theme": "anger", "scripture": "Ephesians 4:26", "source": "pastoral"}
{"input": "I'm so angry I can't think straight", "response": "The longer you hold onto anger, the more it turns into bitterness. Deal with it today. Don't go to bed with unresolved anger in your heart. Don't let it sit overnight and grow roots. Have the hard conversation. Extend the apology. Make it right before the day is done. Bitterness starts when anger overstays its welcome. \"Don't let the sun go down on your wrath.\" (Ephesians 4:26)", "theme": "anger", "scripture": "Ephesians 4:26", "source": "pastoral"}
{"input": "They don't deserve forgiveness", "response": "Bitterness will poison your soul faster than anything else. You've got to let it go. That grudge you're holding, that person you refuse to forgive, that offense you keep replaying in your mind—it's killing you, not them. Put it away. Lay it down. Ask God to heal the wound and release you from the bitterness. \"Let all bitterness, wrath, anger, outcry, and slander be put away from you, with all malice.\" (Ephesians 4:31)", "theme": "anger", "scripture": "Ephesians 4:31", "source": "pastoral"}
{"input": "I want them to pay for this", "response": "You don't have to match their energy. Respond with gentleness. When someone comes at you with anger, you have a choice. You can escalate it, or you can de-escalate it with a gentle answer. It takes the Holy Spirit to do that, but it works. A soft word can stop a fight before it starts. \"A gentle answer turns away wrath, but a harsh word stirs up anger.\" (Proverbs 15:1)", "theme": "anger", "scripture": "Proverbs 15:1", "source": "pastoral"}
{"input": "I keep replaying it in my mind", "response": "Quick anger leads to foolish decisions. Don't react immediately. Don't send that text. Don't fire off that email. Don't say what's on the tip of your tongue. Take a breath. Take a walk. Take a moment to pray. The Bible says be slow to anger because fast anger leads to sin and regret. \"Let every man be swift to hear, slow to speak, and slow to anger, for the anger of man doesn't produce the righteousness of God.\" (James 1:19-20)", "theme": "anger", "scripture": "James 1:19-20", "source": "pastoral"}
{"input": "This rage is consuming me", "response": "Your anger won't fix the problem. It'll just make it worse. You can't yell someone into repentance. You can't rage someone into righteousness. Human anger doesn't accomplish God's purposes. If you're angry, bring it to God first. Let him calm your heart before you try to address the issue. \"For the anger of man doesn't produce the righteousness of God.\" (James 1:20)", "theme": "anger", "scripture": "James 1:20", "source": "pastoral"}
{"input": "I said things I can't take back", "response": "Resentment is anger that's been left to ferment. If you're replaying the offense over and over in your mind, that's resentment. If you're keeping a mental list of every wrong they've done, that's bitterness. And it will destroy you. Forgive them—not because they deserve it, but because YOU deserve peace. \"Let all bitterness, wrath, anger, outcry, and slander be put away from you.\" (Ephesians 4:31)", "theme": "anger", "scripture": "Ephesians 4:31", "source": "pastoral"}
{"input": "How do I stop being so angry", "response": "Bitterness will kill intimacy faster than anything else. Men, if you're holding onto resentment toward your wife, it will poison your marriage. Address the issue, talk it through, but don't let bitterness take root. Love her even when it's hard. Forgive her even when she doesn't ask. That's what Christ does for you. \"Husbands, love your wives, and don't be bitter against them.\" (Colossians 3:19)", "theme": "anger", "scripture": "Colossians 3:19", "source": "pastoral"}
{"input": "I'm bitter and I know it", "response": "The devil loves it when you stay angry. It gives him access to your life. When you hold onto anger, you're giving the enemy a foothold in your heart. He'll use that anger to isolate you, to make you irrational, to destroy your relationships. Don't give him that power. Deal with the anger quickly and let God heal your heart. \"Don't let the sun go down on your wrath, and don't give place to the devil.\" (Ephesians 4:26-27)", "theme": "anger", "scripture": "Ephesians 4:26-27", "source": "pastoral"}
{"input": "I can't control my anger anymore", "response": "Vengeance isn't yours. It's God's. You don't have to get even. You don't have to make them pay. God sees what they did, and he will handle it. Your job is to forgive, to release them to God, and to trust that he will make all things right in his time. Let go and let God. \"Don't seek revenge yourselves, beloved, but give place to God's wrath. For it is written, 'Vengeance belongs to me; I will repay, says the Lord.'\" (Romans 12:19)", "theme": "anger", "scripture": "Romans 12:19", "source": "pastoral"}
