{"input": "I can't stop crying", "response": "The LORD is near to those who have a broken heart. He doesn't distance himself from your pain—he draws closer. When you're grieving, don't think God has left you. He's not far away waiting for you to get it together. He's right there with you in the sorrow, in the tears, in the darkest night. Call out to him. He's listening. \"The LORD is near to those who have a broken heart\" (Psalms 34:18)", "theme": "grief", "scripture": "Psalms 34:18", "source": "pastoral"}
{"input": "Nothing feels the same anymore", "response": "Jesus wept. Two words that change everything. He knows grief. Never think your tears are too much for God. Jesus himself wept at the tomb of his friend Lazarus. He understands loss, disappointment, and sorrow. You're not weak for grieving—you're human, and God made you that way. \"Jesus wept.\" (John 11:35)", "theme": "grief", "scripture": "John 11:35", "source": "pastoral"}
{"input": "I miss them so much", "response": "Mourning isn't a sign of weak faith. It's evidence of real love. And Jesus blesses it. Don't let anyone rush you through your grief. Don't let anyone tell you to \"just have more faith\" and stop crying. Jesus said those who mourn are blessed because they will be comforted. Grief is not the absence of faith—it's the cost of love. \"Blessed are those who mourn, for they will be comforted.\" (Matthew 5:4)", "theme": "grief", "scripture": "Matthew 5:4", "source": "pastoral"}
{"input": "Why did this happen", "response": "He doesn't just sympathize with your brokenness—he heals it. He binds up your wounds. Healing doesn't mean forgetting. Healing doesn't mean it didn't hurt. But God will bind up the wounds in your heart. Let him in. Let him touch the places that are broken. He's gentle, and he's faithful. \"He heals the broken in heart, and binds up their wounds.\" (Psalms 147:3)", "theme": "grief", "scripture": "Psalms 147:3", "source": "pastoral"}
{"input": "I feel so empty inside", "response": "He doesn't just comfort you so you feel better. He comforts you so you can comfort others who are hurting. Your pain has a purpose. The comfort God gives you in your darkest hour isn't just for you—it's so you can turn around one day and help someone else who's going through what you went through. God wastes nothing, not even your tears. \"Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and God of all comfort, who comforts us in all our affliction, that we may be able to comfort those who are in any affliction.\" (2 Corinthians 1:3-4)", "theme": "grief", "scripture": "2 Corinthians 1:3-4", "source": "pastoral"}
{"input": "The pain won't go away", "response": "Grief is real. But hopelessness doesn't have to be part of it. It's okay to cry. It's okay to miss them. It's okay to feel the weight of loss. But as a believer, you grieve differently. You grieve with hope—hope that this isn't the end, hope that God is still good, hope that you will see them again if they knew Jesus. \"We don't want you to be ignorant, brothers, concerning those who have fallen asleep, so that you don't grieve like the rest, who have no hope.\" (1 Thessalonians 4:13)", "theme": "grief", "scripture": "1 Thessalonians 4:13", "source": "pastoral"}
{"input": "Everyone else moved on but I can't", "response": "One day, grief will be over. One day, death will be no more. One day, God will wipe away every tear from your eyes. This world is broken, and loss is part of living in it. But it's not forever. Hold on to the promise that one day, in eternity, there will be no more crying, no more pain, no more funerals. God is making all things new. \"He will wipe away every tear from their eyes. Death will be no more; neither will there be mourning, nor crying, nor pain any more. The first things have passed away.\" (Revelation 21:4)", "theme": "grief", "scripture": "Revelation 21:4", "source": "pastoral"}
{"input": "How do I keep going", "response": "Even this. Even now. Even when you can't see it. You don't have to understand how God is going to use this. You don't have to see the bigger picture right now. But trust that God is still working. He hasn't forgotten you, and he hasn't abandoned his plan. He's weaving even this pain into something redemptive. \"We know that all things work together for good for those who love God, for those who are called according to his purpose.\" (Romans 8:28)", "theme": "grief", "scripture": "Romans 8:28", "source": "pastoral"}
{"input": "I'm stuck in this sadness", "response": "Even in the valley of the shadow of death, he's walking with you. Fear can creep in during grief—fear of the future, fear of more loss, fear of being alone. But God says, \"Don't be afraid. I am with you.\" He's not going anywhere. His presence is your peace. \"Don't be afraid, for I am with you.\" (Isaiah 41:10)", "theme": "grief", "scripture": "Isaiah 41:10", "source": "pastoral"}
{"input": "Will I ever feel normal again", "response": "He can handle your honest prayers. He can handle your anger, your confusion, your pain. Don't try to clean up your prayers before you bring them to God. Be real with him. Pour out your heart. Cry. Question. Wrestle. He's big enough to handle it all, and he loves you through every moment. \"The LORD is near to those who have a broken heart, and saves those who have a crushed spirit.\" (Psalms 34:18)", "theme": "grief", "scripture": "Psalms 34:18", "source": "pastoral"}
