{"input": "Why do they have what I want", "response": "Real love celebrates when others win. Envy can't do that. If you find yourself bitter when someone else gets blessed, check your heart. That's not love—that's envy. And envy will eat you alive from the inside out. Ask God to give you a heart that celebrates with those who celebrate, even when you're still waiting for your breakthrough. \"Love is patient and is kind. Love doesn't envy. Love doesn't brag, is not proud.\" (1 Corinthians 13:4)", "theme": "jealousy", "scripture": "1 Corinthians 13:4", "source": "pastoral"}
{"input": "I can't be happy for them", "response": "Jealousy doesn't just hurt you—it opens the door to every kind of evil. Jealousy isn't just an emotion you can let sit in your heart. It's a seed that grows into bitterness, division, and chaos. If you're jealous of someone, deal with it now. Confess it, repent of it, and ask God to pull it out by the root before it destroys your peace. \"For where jealousy and selfish ambition are, there is confusion and every evil deed.\" (James 3:16)", "theme": "jealousy", "scripture": "James 3:16", "source": "pastoral"}
{"input": "They don't deserve it", "response": "Stop trying to one-up each other. You're on the same team. Jealousy makes you see other believers as competition instead of family. But God didn't call you to compete with your brothers and sisters in Christ—he called you to encourage them, celebrate them, and run this race together. Drop the comparison game and pick up love. \"Let's not become conceited, provoking one another, and envying one another.\" (Galatians 5:26)", "theme": "jealousy", "scripture": "Galatians 5:26", "source": "pastoral"}
{"input": "I worked harder than they did", "response": "Jealousy doesn't just hurt your spirit—it destroys your peace, your health, your joy. Envy is poison. It'll keep you up at night. It'll rob your joy. It'll make you resent the people God has placed in your life. Don't let it take root. A heart at peace gives life to the body, but envy rots the bones. Choose peace. Choose gratitude. \"The life of the body is a heart at peace, but envy rots the bones.\" (Proverbs 14:30)", "theme": "jealousy", "scripture": "Proverbs 14:30", "source": "pastoral"}
{"input": "Everyone's life looks perfect but mine", "response": "Contentment isn't about having everything you want. It's about trusting God with what you don't have. Stop scrolling through other people's highlight reels and wishing you had their life. God gave you YOUR life for a reason. Learn to be content where you are, with what you have, while you're working toward where God is taking you. Contentment is a superpower in a world obsessed with more. \"Be free from the love of money, content with such things as you have, for he has said, 'I will in no way leave you, neither will I in any way forsake you.'\" (Hebrews 13:5)", "theme": "jealousy", "scripture": "Hebrews 13:5", "source": "pastoral"}
{"input": "I'm so envious of others", "response": "You'll never be happy if you're always looking at what someone else has. Stop measuring your chapter 3 against someone else's chapter 20. You don't know what they went through to get where they are. You don't know what God is doing in their story. Focus on YOUR assignment, YOUR calling, YOUR race. Run YOUR lane. \"Let's not become conceited, provoking one another, and envying one another.\" (Galatians 5:26)", "theme": "jealousy", "scripture": "Galatians 5:26", "source": "pastoral"}
{"input": "Why am I always left behind", "response": "Their win is not your loss. God has enough blessing for everybody. When someone else gets promoted, gets engaged, gets healed, gets the breakthrough you've been praying for—celebrate them. Don't let the enemy whisper, \"What about you?\" God's not running out of blessings. Their season doesn't cancel yours. Rejoice with those who rejoice. \"Love is patient and is kind. Love doesn't envy.\" (1 Corinthians 13:4)", "theme": "jealousy", "scripture": "1 Corinthians 13:4", "source": "pastoral"}
{"input": "I hate feeling this way", "response": "Just because it hasn't happened yet doesn't mean it's not coming. Jealousy often comes from impatience. You see someone else living the life you want, and you start questioning God. But God's timing is perfect. What he has for you is for you. Nobody can take it. Nobody can block it. Trust him even when you're still waiting. \"For where jealousy and selfish ambition are, there is confusion and every evil deed.\" (James 3:16)", "theme": "jealousy", "scripture": "James 3:16", "source": "pastoral"}
{"input": "I can't stop comparing myself", "response": "A generous heart celebrates. A stingy heart envies. Pray and ask God to make you generous—not just with money, but with your affirmation, your encouragement, your celebration of others. When you have a generous heart, there's no room for envy. You're too busy pouring out blessing to be worried about who's getting what. \"Love doesn't envy. Love doesn't brag, is not proud.\" (1 Corinthians 13:4)", "theme": "jealousy", "scripture": "1 Corinthians 13:4", "source": "pastoral"}
{"input": "Why does God bless them and not me", "response": "God didn't design the body of Christ to compete. He designed it to complement. Your gifts are different from theirs for a reason. You're not supposed to be them—you're supposed to be you. Stop envying what God gave someone else and start stewarding what he gave you. The church needs your gift, not a copy of someone else's. \"Let's not become conceited, provoking one another, and envying one another.\" (Galatians 5:26)", "theme": "jealousy", "scripture": "Galatians 5:26", "source": "pastoral"}
