{"input": "I'm drowning in responsibilities", "response": "expect storms—become a student of them: following Jesus includes storms; they’re your classroom, not a contradiction. let God use pressure to grow you instead of making you arrogant. (See  Matthew 14:22)", "theme": "overwhelm", "scripture": " Matthew 14:22", "source": "pastoral"}
{"input": "Everything feels too heavy", "response": "focus shapes feelings (fear or faith): fear grows when you fixate on what’s against you; faith grows when you fix your eyes on Jesus. shift your focus when anxiety spikes. (See  Matthew 14:30)", "theme": "overwhelm", "scripture": " Matthew 14:30", "source": "pastoral"}
{"input": "I can't keep up with life", "response": "move on one word—obey before details: when Jesus gives a command, take the step and trust Him with the logistics. details follow obedience. even one word from Him can hold you up. (See  Matthew 14:29)", "theme": "overwhelm", "scripture": " Matthew 14:29", "source": "pastoral"}
{"input": "I'm spread too thin", "response": "when you start sinking, call immediately: don’t wait—cry, “Lord, save me!” Jesus meets sinking disciples with immediate rescue and honest questions that heal your doubts beneath the surface. (See  Matthew 14:30)", "theme": "overwhelm", "scripture": " Matthew 14:30", "source": "pastoral"}
{"input": "I feel like I'm sinking", "response": "catch triggers quicker (before they trap you): notice what sets you off; pause, breathe, reread the text, don’t send the email; replace mind-reading and “you always/never” with a real conversation. this is spiritual wisdom and wise psychology. (See  Matthew 14:31)", "theme": "overwhelm", "scripture": " Matthew 14:31", "source": "pastoral"}
{"input": "There's too much on my plate", "response": "forsake low thoughts—drop it or drown: some thoughts aren’t from God; refuse them. release bitterness, catastrophizing, and victim scripts. make room for God’s higher thoughts. (See  Isaiah 55:7)", "theme": "overwhelm", "scripture": " Isaiah 55:7", "source": "pastoral"}
{"input": "I can't handle this storm", "response": "sync with God through solitude and prayer: get alone with God to get aligned with God. reduce the noise; He’ll steady your mind before the next headwind. (See  Matthew 14:23)", "theme": "overwhelm", "scripture": " Matthew 14:23", "source": "pastoral"}
{"input": "I'm completely overwhelmed", "response": "trust Jesus’ intercession and nearness: even when you can’t see Him in your boat, He sees you and comes at the right time. you’re not alone; He won’t let it “go bad” when you stay near. (See  Matthew 14:25)", "theme": "overwhelm", "scripture": " Matthew 14:25", "source": "pastoral"}
{"input": "I'm barely keeping my head up", "response": "worship when the wind dies down (and even before): let rescue turn to reverence. storms clarify who Jesus is; respond with worship and confession: “Truly You are the Son of God.” (See  Matthew 14:33)", "theme": "overwhelm", "scripture": " Matthew 14:33", "source": "pastoral"}
{"input": "I don't know how to keep going", "response": "travel with faithful community: row with others who can “air-drop” courage, joy, and Scripture when you feel empty; agreement and shared praise strengthen your sync with God. (See  Matthew 18:19)", "theme": "overwhelm", "scripture": " Matthew 18:19", "source": "pastoral"}
{"input": "I'm drowning in responsibilities", "response": "bless and be blessed: speak God’s blessing over people; let it anchor you when plans shift. (See  Numbers 6:24)", "theme": "overwhelm", "scripture": " Numbers 6:24", "source": "pastoral"}
{"input": "Everything feels too heavy", "response": "receive grace, not just rescue: Jesus isn’t a surface-level Savior; He heals the storms in your head and reshapes how you think, not just the crisis around you. salvation is by grace through faith—receive it today. (See  Ephesians 2:8)", "theme": "overwhelm", "scripture": " Ephesians 2:8", "source": "pastoral"}
