{"input": "My marriage is falling apart", "response": "Sacrificial love isn't optional. It's the standard. Men, you're called to love your wife the way Christ loved the church—and he gave his life for her. That means putting her needs above your own, serving her, protecting her, and leading her with love, not control. If you want a healthy marriage, start by loving her like Jesus loves you. \"Husbands, love your wives, even as Christ also loved the assembly and gave himself up for her.\" (Ephesians 5:25)", "theme": "relationships", "scripture": "Ephesians 5:25", "source": "pastoral"}
{"input": "We keep fighting about the same things", "response": "Respect isn't about him being perfect. It's about honoring his position. Ladies, your husband needs your respect more than he needs your approval. Even when he's not getting it all right, honor him. Speak life over him. Believe in him. When a man feels respected by his wife, he will move mountains for her. \"However each one of you must also love his own wife even as himself; and let the wife see that she respects her husband.\" (Ephesians 5:33)", "theme": "relationships", "scripture": "Ephesians 5:33", "source": "pastoral"}
{"input": "I don't feel loved anymore", "response": "Resentment will kill your marriage faster than almost anything else. Husbands, don't be bitter against your wives. Wives, don't let resentment take root in your heart. Deal with offenses quickly. Talk it through. Forgive. Don't go to bed angry. Bitterness is poison, and it will destroy the intimacy you're trying to build. \"Husbands, love your wives, and don't be bitter against them.\" (Colossians 3:19)", "theme": "relationships", "scripture": "Colossians 3:19", "source": "pastoral"}
{"input": "How do I save my marriage", "response": "You can't love them well if you don't know them well. Husbands, take time to understand your wife. Learn what makes her feel loved, what she needs, what her fears are. Don't assume. Ask. Listen. Live with her in an understanding way, and honor her as a co-heir of the grace of life. Your prayers depend on it. \"You husbands, in the same way, live with your wives according to knowledge, giving honor to the woman as to the weaker vessel, as also being joint heirs of the grace of life, that your prayers may not be hindered.\" (1 Peter 3:7)", "theme": "relationships", "scripture": "1 Peter 3:7", "source": "pastoral"}
{"input": "We've grown apart", "response": "If you've got a godly woman, treat her like the treasure she is. A wife of noble character is worth far more than rubies. If God has blessed you with a woman who loves him, serves him, and stands by you, don't take her for granted. Honor her. Celebrate her. Let her know she's valued. \"Who can find a worthy woman? For her value is far above rubies.\" (Proverbs 31:10)", "theme": "relationships", "scripture": "Proverbs 31:10", "source": "pastoral"}
{"input": "I'm not attracted to them anymore", "response": "Marriage requires the same love Jesus has for you. If you want your marriage to last, you've got to practice 1 Corinthians 13 love. Be patient. Be kind. Don't keep a record of wrongs. Don't give up when it gets hard. Love isn't a feeling—it's a commitment. Choose it every day. \"Love is patient and is kind. Love doesn't envy. Love doesn't brag, is not proud, doesn't behave itself inappropriately, doesn't seek its own way, is not provoked, takes no account of evil; doesn't rejoice in unrighteousness, but rejoices with the truth; bears all things, believes all things, hopes all things, and endures all things.\" (1 Corinthians 13:4-7)", "theme": "relationships", "scripture": "1 Corinthians 13:4-7", "source": "pastoral"}
{"input": "Communication is broken", "response": "Go to bed at peace, not at war. Don't let unresolved conflict sit overnight. Deal with it. Apologize if you need to. Forgive if you need to. Don't let the enemy use your anger to create a wedge in your marriage. Resolve it before you go to sleep. \"Be angry, and don't sin. Don't let the sun go down on your wrath.\" (Ephesians 4:26)", "theme": "relationships", "scripture": "Ephesians 4:26", "source": "pastoral"}
{"input": "Should I stay or leave", "response": "The two of you are on the same team. The enemy wants you to forget that. When conflict arises, remember: it's not you versus them. It's the two of you versus the problem. Don't attack each other. Attack the issue together. You're partners, not opponents. \"Bear with one another, and forgive each other, if any man has a complaint against any; even as Christ forgave you, so you also do.\" (Colossians 3:13)", "theme": "relationships", "scripture": "Colossians 3:13", "source": "pastoral"}
{"input": "I feel alone in this marriage", "response": "Couples who pray together stay together. If you want your marriage to thrive, pray together. Pray for each other. Pray over your home, your finances, your kids, your future. When you invite God into the center of your marriage, everything changes. \"You husbands, in the same way, live with your wives according to knowledge, giving honor to the woman as to the weaker vessel, as also being joint heirs of the grace of life, that your prayers may not be hindered.\" (1 Peter 3:7)", "theme": "relationships", "scripture": "1 Peter 3:7", "source": "pastoral"}
{"input": "We've lost the spark", "response": "Contracts have escape clauses. Covenants don't. You didn't just sign a piece of paper—you made a covenant before God. That means when it gets hard, you don't quit. You fight for it. You get help. You pray. You push through. God honors covenant, and he will give you the grace to keep yours. \"Husbands, love your wives, even as Christ also loved the assembly and gave himself up for her.\" (Ephesians 5:25)", "theme": "relationships", "scripture": "Ephesians 5:25", "source": "pastoral"}
