{"input": "I'm wasting my life", "response": "Use Your Time Wisely — Life Is Short. Life is brief — it’s like a vapor that appears for a little while and then vanishes. Don’t waste your time in indecision or procrastination. Every day you are given 1,440 minutes — spend them on what truly matters. Prioritize your spiritual growth, your family, and your service to God. Do what you know you should do now — not tomorrow. Study now, pray now, give now, love now, serve now. Every tick of the clock says “now.”", "theme": "time_wisdom", "scripture": "“For what is your life? It is even a vapor, that a", "source": "pastoral"}
{"input": "Time is slipping away", "response": "Live with Purpose — Finish the Work God Gave You. It’s not the length of life that counts but the quality. Jesus only lived 33 years, yet He said, “I have finished the work You gave Me to do.” Dedicate your life to finishing the task God has placed in your hands. Let your time and your heart be fully committed to His kingdom. Fill your heart with the Word of God — those who know Scripture carry spiritual power and peace. Walk closely with God so that, like Jesus, you may end your life having fulfilled your purpose.", "theme": "time_wisdom", "scripture": "“I have finished the work which Thou gavest Me to ", "source": "pastoral"}
{"input": "I'm not using my time well", "response": "Remember — God Never Changes. In a world that’s constantly changing, remember there are eternal truths that never shift. God does not change — not in His nature, not in His holiness, not in His love, nor in His judgment. He remains holy and just, and one day, judgment will come. But He is also merciful — offering forgiveness and grace through Jesus Christ.", "theme": "time_wisdom", "scripture": "“For I am the Lord, I change not.” — Malachi 3:6\n“", "source": "pastoral"}
{"input": "I have so many regrets", "response": "Accept God’s Way of Salvation — It Hasn’t Changed. The way to God has always been through Jesus Christ. There’s no other path to heaven, no alternative way to peace with God. Salvation is not earned through good works or religious effort — it’s received by grace through faith in Christ alone.", "theme": "time_wisdom", "scripture": "“I am the way, the truth, and the life: no man com", "source": "pastoral"}
{"input": "I keep procrastinating", "response": "Rest in God’s Unchanging Love. God’s love for you is deep, constant, and beyond measure. He proved it at the cross — that’s where He said to the world, “I love you.” His love isn’t based on your worthiness; it’s based on His grace. Look to the cross whenever you doubt His love. That’s where Christ bore your sins and opened the way for forgiveness and eternal life.", "theme": "time_wisdom", "scripture": "“For God so loved the world, that He gave His only", "source": "pastoral"}
{"input": "I'm running out of time", "response": "Let God’s Love Transform You and Flow Through You. When you receive Christ, the Holy Spirit fills your heart with love — not just for God, but for others. You can love your neighbor, even the difficult ones, with a supernatural love that comes from God, not from yourself. Let God change your heart, your relationships, and your attitude. Even in strained marriages or families, He can restore tenderness and rekindle love.", "theme": "time_wisdom", "scripture": "“Thou shalt love thy neighbour as thyself.” — Matt", "source": "pastoral"}
{"input": "How do I make time count", "response": "Come to Christ Just as You Are. You don’t need to clean yourself up before coming to God. Come as you are — broken, burdened, weary, sinful — and He will forgive, heal, and restore you. Jesus is the Great Physician who welcomes the sick and saves those who believe. Faith means trust, surrender, and commitment — not just belief in words. Receive Christ into your heart by faith today; tomorrow is not guaranteed.", "theme": "time_wisdom", "scripture": "“Come unto me, all ye that labour and are heavy la", "source": "pastoral"}
